In [1]:
# Install MySql packages
# conda update -n base -c conda-forge conda --yes
# !pip install ipython-sql
# !pip install mysql-connector-python
# !conda install -c conda-forge python-dotenv --yes

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels as sm
import mysql.connector
from mysql.connector import Error
from os import environ, path
from dotenv import load_dotenv

In [3]:
# Read enviromental variables to connect the database
load_dotenv()
password = environ.get('PASSWORD')
host = environ.get('HOST')
database = environ.get('DATABASE')

## Connect to the database and create dataframes for each table

In [4]:
try:
    connection = mysql.connector.connect(host=host ,
                                        database=database,
                                        user='root',
                                        password=password)
    if connection.is_connected():
        print("Succes Connected")
    df_musician = pd.read_sql_query("SELECT * FROM music_and_death.musician;", connection)
    df_birth = pd.read_sql_query("SELECT * FROM music_and_death.birth;", connection)
    df_death = pd.read_sql_query("SELECT * FROM music_and_death.death;", connection)
    df_genre = pd.read_sql_query("SELECT * FROM music_and_death.music_genre;", connection)
    genre = pd.read_sql_query("SELECT * FROM music_and_death.genre;", connection)
    cause_death = pd.read_sql_query("SELECT * FROM music_and_death.cause_death;", connection)
    cities = pd.read_sql_query("SELECT * FROM music_and_death.cities;", connection)
    states = pd.read_sql_query("SELECT * FROM music_and_death.states;", connection)
    countries = pd.read_sql_query("SELECT * FROM music_and_death.countries;", connection)
    
    
except Error as e:
    print("Error closing connection")

# Concatenate tables
else:
    # Concatenate musician and death dataframes
    df = pd.concat([df_musician, df_birth], axis=1)
    df = pd.concat([df, df_death], axis=1)
    df = pd.merge(df, cause_death, on=["death_id", "death_id"])
    df = df.loc[:, ~df.columns.duplicated()].copy()
    df = pd.merge(df, df_genre, on=["musician_id"])
    df = df.loc[:, ~df.columns.duplicated()].copy()
    df = pd.merge(df, genre, on=["genre_id"])
    # rearrange columns
    df = df.iloc[:, [0, 1, 2, 3, 5, 7, 8, 9, 11, 6, 4, 10]]
    
finally:
    connection.close()

Succes Connected

## Merge and clean the cities, states and countries tables

In [5]:
# merge cities table with states table
place = cities.merge(states, 
                      left_on=cities["state_id"], 
                      right_on=states["id"])

# drop duplicate keys
place.drop(['key_0', 'state_id', 'id_y'], axis=1, inplace=True)

# merge resulted table with countries table
place = place.merge(countries, 
                        left_on=place["country_id"],
                        right_on=countries["id"])

# drop duplicated keys
place.drop(['key_0', 'country_id', 'id', 'iso2', 'capital'], 
              axis=1, 
              inplace=True)

# rename column names
place.rename(
    columns={'name_x': 'City', 
             'name_y': 'State', 
             'name': 'Country', 
             'id_x': 'city_id'},
    inplace=True
)

##  Drop columns with not use

In [6]:
df.drop(['middle_name', 'death_id', "death_date", "genre_id", "birth"], 
        axis=1, 
        inplace=True)

In [7]:
df

,musician_id,stage_name,stage_lastname,death_age,cause,genre,birthplace_id
0,1,John,Lennon,40,homicide,rock,50337
1,2,Kurt,Cobain,27,suicide,rock,110979
2,17,Chris,Cornell,52,suicide,rock,126104
3,18,Chester,Bennington,41,suicide,rock,124148
4,32,Ian,Curtis,23,suicide,rock,51499
...,...,...,...,...,...,...,...
128,119,Sol,Hoʻopiʻi,51,diabetes,blues,118623
129,112,Papa,McCoy,41,brain disorder,blues,119065
130,115,Luke,Jordan,58,not reported,blues,120916
131,127,Ralph,Willis,47,not reported,blues,112358
132,124,Johnny,Ace,25,accidental self-inflicted gunshot,blues,121639

In [8]:
place

        city_id                 City              State      Country
0            52            Ashkāsham         Badakhshan  Afghanistan
1            68             Fayzabad         Badakhshan  Afghanistan
2            78                 Jurm         Badakhshan  Afghanistan
3            84              Khandūd         Badakhshan  Afghanistan
4           115            Rāghistān         Badakhshan  Afghanistan
...         ...                  ...                ...          ...
148261   131496             Redcliff  Midlands Province     Zimbabwe
148262   131502             Shangani  Midlands Province     Zimbabwe
148263   131503             Shurugwi  Midlands Province     Zimbabwe
148264   131504    Shurugwi District  Midlands Province     Zimbabwe
148265   131508  Zvishavane District  Midlands Province     Zimbabwe

[148266 rows x 4 columns]

## Merge musician info dataframe with place dataframe

In [9]:
# merge df and place dataframes
musician = df.merge(place, 
                    left_on=df['birthplace_id'], 
                    right_on=place['city_id'])

# drop unused columns
musician.drop(['birthplace_id', 'city_id', 'key_0'], axis=1, inplace=True)

In [10]:
musician

,musician_id,stage_name,stage_lastname,death_age,cause,genre,City,State,Country
0,1,John,Lennon,40,homicide,rock,Liverpool,England,United Kingdom
1,2,Kurt,Cobain,27,suicide,rock,Aberdeen,Washington,United States
2,17,Chris,Cornell,52,suicide,rock,Seattle,Washington,United States
3,8,Jimi,Hendrix,27,alcohol overdose,rock,Seattle,Washington,United States
4,18,Chester,Bennington,41,suicide,rock,Phoenix,Arizona,United States
...,...,...,...,...,...,...,...,...,...
127,130,William,Handy,84,pneumonia,blues,Florence,Alabama,United States
128,119,Sol,Hoʻopiʻi,51,diabetes,blues,Honolulu,Hawaii,United States
129,112,Papa,McCoy,41,brain disorder,blues,Jackson,Mississippi,United States
130,115,Luke,Jordan,58,not reported,blues,Lynchburg,Virginia,United States
131,127,Ralph,Willis,47,not reported,blues,Birmingham,Alabama,United States